---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCurtainGridLine
source: html/37c4255e-1b30-fa7a-b266-fe2a6c7cf66c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCurtainGridLine Property

Can't paste Curtain Grid Line.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteCurtainGridLine { get; }
```